Задание 1

In [12]:
import pandas as pd

In [3]:
abc = ds=pd.read_csv('ratings.csv', sep = ',')
abc1 = abc[abc['rating']==5.0].groupby('movieId').count().sort_values('rating',ascending = False)

In [4]:
movies = pd.read_csv('movies.csv',sep = ',')

In [5]:
abc2 = abc1.merge(movies,on = 'movieId',how = 'left')
print(abc2[['movieId','title']].head(1))

   movieId                             title
0      318  Shawshank Redemption, The (1994)

Задание 2

In [79]:
ds=pd.read_csv('power.csv', sep = ',')
ds2=ds[(ds['year']>=2005)&(ds['year']<=2010)&(ds['quantity']>0)]
ds3=ds2[ds2.category.isin([4,12,21])]
filtered_countries_est = ds3[(ds3['country']=='Estonia')]['quantity'].sum()
filtered_countries_lit = ds3[(ds3['country']=='Lithuania')]['quantity'].sum()
filtered_countries_lat = ds3[(ds3['country']=='Latvia')]['quantity'].sum()
print(f'Cуммарное потребление: {filtered_countries_lat+filtered_countries_est+filtered_countries_lit}')

Cуммарное потребление: 240580.0

Задание 3

In [11]:
datanew = pd.read_html('https://www.accountingtools.com/articles/2017/5/17/bank-reconciliation',encoding = 'utf-8')[0]
datanew.head(20)

,0,1,2,3
0,NaN,NaN,Item #,Adjustment to Books
1,Bank balance,"$320,000",1,NaN
2,- Check printing charge,-200,2,"Debit expense, credit cash"
3,- Service charge,-150,3,"Debit expense, credit cash"
4,- NSF fee,-10,4,"Debit expense, credit cash"
5,- NSF deposit rejected,- 500,4,"Debit receivable, credit cash"
6,+ Interest income,+ 30,5,"Debit cash, credit interest income"
7,- Uncleared checks,"- 80,000",6,None
8,+ Deposits in transit,"+ 25,000",7,None
9,Book balance,"$264,170",NaN,NaN